print("{} 평균 : {:.2f}".format("홍길동",(100+100+99)/3))
name = "홍길동"
avg = "{:.2f}".format(99.66667)
print(f"{name} 평균 : {avg}")   # f 구분 소수점 자리 지정하는 방법

a = 1.12345
print(f"소수점 2자리 출력 : {a:.2f}")   # f 구분 소수점 자리 지정하는 방법

print("출력이 됩니다.!!")

print("""'1.\
음주 뺑소니'로 재판에 넘겨진 트로트 가수 김호중씨에 대해 검찰이 징역 3년 6개월을 구형했습니다.
검찰은 또 사고를 은폐하는데 관연한 김씨의 소속사 이광득 대표와 본부장 전모씨 에게는 징역 3년을 구형했습니다.""")



# print("%s 합계 : %d" % (name,num+num2))

# print("{} 합계 : {}".format(name,num+num2+num3))   # % 구문 보다 더 많이씀
# print("%s 평균 : %.2f" % (name,(num+num2+num3)/3))
# print("{} 평균 :  {:.2f}".format(name,(num+num2+num3)/3))

# num = 12.12345
# num2 = 456.78940
# num3 = 2.252525
# print("숫자 : {:.2f}, {:.2f}, {:.2f}".format(num,num2,num3))

# print("{2:d}, {1:d}, {0:d}".format(100,200,300)) # 순서바꿔서 출력 가능

# # print("\"")
# # print("안녕\n하세요")
# # print("안녕\t하세요")
# # print("안녕\b\b하세요")

# print("""'1.\
# 음주 뺑소니'로 재판에 넘겨진 트로트 가수 김호중씨에 대해 검찰이 징역 3년 6개월을 구형했습니다.
# 검찰은 또 사고를 은폐하는데 관연한 김씨의 소속사 이광득 대표와 본부장 전모씨 에게는 징역 3년을 구형했습니다.""")