# money = 780
# # 500원짜리 1개, 100원짜리 2개, 50원짜리 1개, 10원짜리 3개

# print("500원 동전개수 :",money//500)
# print("100원 동전개수 :",(money%500)//100)
# print("50원 동전개수 :",((money%500)%100)//50)
# print("10원 동전개수 :",(((money%500)%100)%50)//10)

#1759870
#9870
#590

str1 = "1759870"
a = len(str1)

print(a)

str3 = "590"
a = len(str3)



# str1 = input("문자를 입력하세요.")
# a = len(str1)   # 문자의 길이

# print(a)


# if a==5:
#   print("a는 5입니다.")
# elif a==4: # else if
#   print("a는 4입니다.")
# elif a==3: 
#   print("a는 3입니다.")
# else: 
#   print("a 숫자는 2 이하 입니다.")


# print("5만원 지폐 장수 :",money//50000)
# print("1만원 지폐 장수 :",(money%50000)//10000)
# print("5천원 지폐 장수 :",((money%50000)%10000)//5000)
# print("1천원 지폐 장수 :",(((money%50000)%10000)%5000)//1000)
# print("500원 동전 장수 :",((((money%50000)%10000)%5000)%1000)//500)
# print("100원 동전 장수 :",(((((money%50000)%10000)%5000)%1000)%500)//100)
# print("50원 동전 장수 :",((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
# print("10원 동전 장수 :",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)
